var youZiML = {
	"光大证券股份有限公司宁波解放南路证券营业部" : 			"敢死队",
	"广发证券股份有限公司上海东方路证券营业部" : 			"敢死队",
	"平安证券股份有限公司深圳深南东路罗湖商务中心证券营业部":"敢死队",
	"国元证券股份有限公司上海虹桥路证券营业部" : 			"敢死队",
	"平安证券股份有限公司深圳深南东路罗湖商务中心证券营业部" : "敢死队",
	"华泰证券股份有限公司总部" : 							"量化基金",
	"中国国际金融股份有限公司上海分公司" : 					"量化基金",
	"华鑫证券有限责任公司上海分公司" : 						"量化打板",
	"瑞银证券有限责任公司上海花园石桥路证券营业部" : 		"境外机构",
	"国泰君安证券股份有限公司总部" : 						"境外机构",

	"华鑫证券有限责任公司上海茅台路证券营业部": 			"炒股养家",
	"华鑫证券有限责任公司上海红宝石路证券营业部" :  		"炒股养家",
	"兴业证券股份有限公司上海金陵东路证券营业部" : 			"苏州帮",
	"国泰君安证券股份有限公司上海分公司" : 					"葛卫东",
	"中信证券股份有限公司上海溧阳路证券营业部" : 			"孙哥",
	"中信证券股份有限公司上海瑞金南路证券营业部" : 			"孙哥",
	"中国银河证券股份有限公司杭州凤起路证券营业部" : 		"杭州帮",
	"东莞证券股份有限公司浙江分公司" : 						"苏南帮",
	"华泰证券股份有限公司无锡金融一街证券营业部" : 			"苏南帮",
	"中国银河证券股份有限公司北京中关村大街证券营业部" : 	"苏南帮",
	"东莞证券股份有限公司四川分公司" : 						"苏南帮",
	"东莞证券股份有限公司北京分公司" : 						"著名刺客",
	
	"兴业证券股份有限公司陕西分公司" : 						"方新侠",
	"中信证券股份有限公司西安朱雀大街证券营业部" : 			"方新侠",
	"华泰证券股份有限公司上海牡丹江路证券营业部" : 			"新生代",
	"华泰证券股份有限公司上海普陀区江宁路证券营业部" : 		"炒新一族",
	"华泰证券股份有限公司上海武定路证券营业部" : 			"炒新一族",
	"华泰证券股份有限公司无锡解放西路证券营业部" : 			"炒新一族",

	"中国银河证券股份有限公司绍兴证券营业部" : 				"赵老哥",
	"华泰证券股份有限公司浙江分公司" : 						"赵老哥",
	"湘财证券股份有限公司上海陆家嘴证券营业部" : 			"赵老哥",
	
	"方正证券股份有限公司杭州延安路证券营业部" : 			"章盟主",
	"国泰君安证券股份有限公司上海江苏路证券营业部" : 		"章盟主",
	"国泰君安证券股份有限公司宁波广福街证券营业部": 		"章盟主",
	"中信证券股份有限公司杭州富春路证券营业部" : 			"章盟主",
	"华泰证券股份有限公司深圳益田路荣超商务中心证券营业部": "徐留胜",
	"国盛证券有限责任公司宁波桑田路证券营业部": 			"游资NO1",
	"中泰证券股份有限公司湖北分公司" : 						"一瞬流光",
	"东亚前海证券有限责任公司深圳分公司" : 					"粉葛",
	"兴业证券股份有限公司南京天元东路证券营业部" :			"92科比",
	"上海证券有限责任公司苏州太湖西路证券营业部" : 			"涅槃重生",
	"华鑫证券有限责任公司江苏分公司": 						"小鳄鱼",
	"南京证券股份有限公司南京大钟亭证券营业部" : 			"小鳄鱼",
	"财通证券股份有限公司杭州上塘路证券营业部" : 			"上塘路",
	"国泰君安证券股份有限公司南京太平南路证券营业部" :		"作手新一",
	
};


function resoleYouZi() {
	let style = ' style="background: #22b935; color: #fff; " ';
	// $('.m-table.m-table-nosort.mt10')
	$('.tl.rel').each(function() {
		let name = $(this).children().attr('title').trim();
		if (youZiML[name]) {
			$(this).append($('<span + ' + style + '> [' + youZiML[name] + '] <span>'));
		} else if (name.indexOf('拉萨') > 0) {
			$(this).append($('<span + ' + style + '> [T王] <span>'));
		}
	});
	fetchLHB();
}

function bindDayChange() {
	$('iframe').each(function() {
		if ($(this).attr('src') != "http://data.10jqka.com.cn/js/My97DatePicker/My97DatePicker.htm")
			return;
		DC = this.contentWindow.day_Click;
		console.log(DC);
		this.contentWindow.day_Click = function(F, B, _, D, C, A) {
			DC(F, B, _, D, C, A);
			setTimeout(function() {
				resoleYouZi();
			}, 2000);
		};
	});
}

setTimeout(function() {
	bindDayChange();
	resoleYouZi();
}, 2000);

