var youZiML = {
	"华鑫证券有限责任公司上海红宝石路证券营业部" :  "炒股养家",
	"华鑫证券有限责任公司上海茅台路证券营业部": "炒股养家",
	"华鑫证券有限责任公司珠海海滨南路证券营业部" : "炒股养家",
	
	"中国银河证券股份有限公司绍兴证券营业部" : "赵老哥",
	"湘财证券股份有限公司上海陆家嘴证券营业部" : "赵老哥",
	
	"申银万国上海陆家嘴营业部"  : "徐翔",
	"国泰君安上海打浦路营业部" : "徐翔",
	"中信证券上海浦东大道营业部" : "徐翔",
	"光大证券杭州庆春路营业部": "孙哥",
	"兴业证券福州湖东路营业部" : "asking",
	"兴业证券股份有限公司陕西分公司" : "方新侠",
	"中信证券股份有限公司西安朱雀大街证券营业部" : "方新侠",
	"国泰君安证券股份有限公司总部": "境外机构",
	"华泰证券股份有限公司总部" : "量化基金",
	"中国国际金融股份有限公司上海分公司" : "量化基金",
	"兴业证券股份有限公司厦门分公司" : "首板挖掘",
	"东莞证券股份有限公司四川分公司" : "苏南帮",
	"中国银河证券股份有限公司北京中关村大街证券营业部" : "苏南帮",
	"中国银河证券股份有限公司北京学院南路证券营业部" : "苏南帮",
	"国泰君安证券股份有限公司上海江苏路证券营业部" : "章盟主",
	"国泰君安证券股份有限公司宁波广福街证券营业部": "章盟主",
	"中信证券股份有限公司杭州富春路证券营业部" :" 章盟主",
	"长江证券股份有限公司佛山普澜二路证券营业部" : "佛山系",
	"中国银河证券股份有限公司杭州凤起路证券营业部": "杭州帮",
	
	"华泰证券股份有限公司深圳益田路荣超商务中心证券营业部": "徐留胜",
	"华鑫证券有限责任公司江苏分公司": "小鳄鱼",
	"国元证券股份有限公司上海虹桥路证券营业部" : "敢死队",
	"平安证券股份有限公司深圳深南东路罗湖商务中心证券营业部" : "敢死队",
	"华泰证券股份有限公司上海牡丹江路证券营业部" : "新生代",
	"国盛证券有限责任公司宁波桑田路证券营业部": "游资NO1",
	"财通证券股份有限公司杭州上塘路证券营业部" : "上塘路",
	"中信证券股份有限公司上海溧阳路证券营业部" : "溧阳路",
	"东亚前海证券有限责任公司江苏分公司" : "涅槃重生",
	"上海证券有限责任公司苏州太湖西路证券营业部" : "涅槃重生",
};


function resoleYouZi() {
	let style = ' style="background: #22b935; color: #fff; " ';
	// $('.m-table.m-table-nosort.mt10')
	$('.tl.rel').each(function() {
		let name = $(this).children().attr('title').trim();
		if (youZiML[name]) {
			$(this).append($('<span + ' + style + '> [' + youZiML[name] + '] <span>'));
		} else if (name.indexOf('拉萨') > 0) {
			$(this).append($('<span + ' + style + '> [T王] <span>'));
		}
	});
	fetchLHB();
}

function bindDayChange() {
	$('iframe').each(function() {
		if ($(this).attr('src') != "http://data.10jqka.com.cn/js/My97DatePicker/My97DatePicker.htm")
			return;
		DC = this.contentWindow.day_Click;
		console.log(DC);
		this.contentWindow.day_Click = function(F, B, _, D, C, A) {
			DC(F, B, _, D, C, A);
			setTimeout(function() {
				resoleYouZi();
			}, 2000);
		};
	});
}

setTimeout(function() {
	bindDayChange();
	resoleYouZi();
}, 2000);

